<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"><html><head></head><body>Copyright &copy; 2006 Sun Microsystems, Inc., <br>4150 Network Circle, Santa Clara, California 95054, U.S.A. All rightsreserved.<br><br>Sun Microsystems, Inc. has intellectual property rights relating totechnologyembodied in the product that is described in this document. Inparticular,and without limitation, these intellectual property rights may includeoneor more of the U.S. patents listed at http://www.sun.com/patents andoneor more additional patents or pending patent applications in the U.S.andin other countries.U.S. Government Rights - Commercial software.&nbsp;Governmentusers are subject to the Sun Microsystems, Inc. standard licenseagreementand applicable provisions of the FAR and its supplements.&nbsp; Use issubjectto license terms.&nbsp; Sun,&nbsp; Sun Microsystems,&nbsp; the Sunlogo,&nbsp;Java,&nbsp; Jini,&nbsp; the Duke logo and&nbsp; the Java Coffee Cuplogoare trademarks or registered trademarks of Sun Microsystems, Inc. intheU.S. and other countries.This product is covered and controlled by U.S.ExportControl laws and may be subject to the export or import laws in othercountries.&nbsp;Nuclear, missile, chemical biological weapons or nuclear maritime endusesor end users, whether direct or indirect, are strictlyprohibited.&nbsp;Export or reexport to countries subject to U.S. embargo or to entitiesidentifiedon U.S. export exclusion lists, including, but not limited to, thedeniedpersons and specially designated nationals lists is strictlyprohibited.&nbsp; <br><br>Copyright &copy; 2006 Sun Microsystems, Inc., <br>4150 Network Circle, Santa Clara, California 95054, Etats-Unis. Tousdroitsr&eacute;serv&eacute;s.<br><br>Sun Microsystems, Inc. d&eacute;tient les droits depropri&eacute;t&eacute;intellectuels relatifs &agrave; la technologie incorpor&eacute;e dansleproduit qui est d&eacute;crit dans ce document. En particulier, et cesanslimitation, ces droits de propri&eacute;t&eacute; intellectuellepeuventinclure un ou plus des brevets am&eacute;ricains list&eacute;s &agrave;l'adressehttp://www.sun.com/patents et un ou les brevets suppl&eacute;mentairesoules applications de brevet en attente aux Etats - Unis et dans lesautrespays.L'utilisation est soumise aux termes de la Licence.Sun,&nbsp; SunMicrosystems,&nbsp;le logo Sun,&nbsp; Java,&nbsp; Jini,&nbsp; le logo Duke et&nbsp; lelogoJava Coffee Cup sont des marques de fabrique ou des marquesd&eacute;pos&eacute;esde Sun Microsystems, Inc. aux Etats-Unis et dans d'autres pays.Ceproduitest soumis &agrave; la l&eacute;gislation am&eacute;ricaine enmati&egrave;rede contr&ocirc;le des exportations et peut &ecirc;tre soumis &agrave;lar&egrave;glementation en vigueur dans d'autres pays dans le domaine desexportationset importations. Les utilisations, ou utilisateurs finaux, pour desarmesnucl&eacute;aires,des missiles, des armes biologiques et chimiques oudunucl&eacute;aire maritime, directement ou indirectement, sontstrictementinterdites. Les exportations ou r&eacute;exportations vers les payssousembargo am&eacute;ricain, ou vers des entit&eacute;s figurant sur leslistesd'exclusion d'exportation am&eacute;ricaines, y compris, mais demani&egrave;renon exhaustive, la liste de personnes qui font objet d'un ordre de nepasparticiper, d'une fa&ccedil;on directe ou indirecte, aux exportationsdesproduits ou des services qui sont r&eacute;gis&nbsp; par lal&eacute;gislationam&eacute;ricaine en mati&egrave;re de contr&ocirc;le des exportationsetla liste de ressortissants sp&eacute;cifiquementd&eacute;sign&eacute;s,sont rigoureusement interdites.</body></html>